""" Услуги """


"""
Сервисы:
1.Выгодные категории повышенного кешбэка
2.Инвесткопилка
3.Простой поиск
4.Поиск по телефонным номерам
5.Поиск переводов физическим лицам

"""




def increased_cashback(data, month, year):
    """1. Ф для анализа выгодности категорий повышенного кешбэка"""
    pass


def investment_machine(month, transactions: List[Dict[str, Any]], limit=50):
    """2. Ф Инвесткопилка"""
    pass


def func_search():
    """3. Простой поиск"""
    pass


def search_phone_numbers():
    """4. Поиск по телефонным номерам"""

    """(Например:
Я МТС +7 921 11-22-33
Тинькофф Мобайл +7 995 555-55-55
МТС Mobile +7 981 333-44-55)
    """
    pass




def transfers_individuals():
    """5. Поиск переводов физическим лицам"""

    """(Функция возвращает JSON со всеми транзакциями, которые относятся к переводам физлицам.

Категория такой транзакции —
Переводы, а в описании есть имя и первая буква фамилии с точкой.
Например:
Валерий А.
Сергей З.
Артем П.

    
    """
    pass


